# not and or /___\ логические не и или
#for i in range (10):  /___\ так прописываеться простой цикл
#  print ('rels',(5+i))
#i = 1
#while i != 10:  /___\ так прописываеться цикл с условием
#    print (i+1)
#    i+=1
#i = 
#print(i+i)

#x = input()
#x = int(x)
#y = x + x
#MAX_SIZE = 100 /___\ Имена переменных, которые неизменяемы(константы) принято записывать капсом
'''stroka = 'неважно каками кавычками'
stroka_2 = "записывать стороки"
stroka_3 = 
для многосррочного текста можно
использовать тройную кавычку
и тройную двойную кавычку
а так же через тройную кавычку выделяться блок кода в коммент

print(stroka_3)
'''
#help(print) /___\ через help пожно справку получить по функциям
#print('n' in 'n,m,e', 'n' not in 'm,l,k') /__\ in и not in показывают, если ты указанное значение в списке\строке\листе. вывожит как true false
#s = 'python'
# s[0] = 'P' приведет к ошибке. Важно помнить, что строку нельзя модифицировать. Засунув в после строки [] и выбрав какое то число, то мы будем работать только с буквой, под номером по порядку
#'P' + s[1:] /___\ при помощи такого метода мы можем создать новую строку, изменив выбранные значения 
